[
    {
      "title": "Irrecha Birraa 2025 - Main Celebration Announced",
      "date": "2025-01-15",
      "content": "The main Irrecha Birraa celebration will take place on September 29, 2025, at Hora Arsadi in Bishoftu. This year's theme focuses on 'Unity, Peace, and Environmental Harmony.' Special arrangements are being made to accommodate the expected 4+ million participants from around the world."
    },
    {
      "title": "UNESCO Cultural Heritage Recognition Ceremony",
      "date": "2025-01-10",
      "content": "A special ceremony will be held to commemorate the 9th anniversary of Irrecha's inscription on UNESCO's Representative List of Intangible Cultural Heritage of Humanity. The event will feature cultural exhibitions, academic discussions, and traditional performances."
    },
    {
      "title": "Global Diaspora Coordination Meeting",
      "date": "2025-01-05",
      "content": "Oromo communities worldwide are coordinating their local Irrecha celebrations. Major cities including Minneapolis, Toronto, London, Melbourne, and Berlin will host synchronized celebrations to maintain cultural connections across the diaspora."
    },
    {
      "title": "Traditional Music and Dance Workshops",
      "date": "2024-12-20",
      "content": "Cultural preservation workshops are being organized to teach traditional Oromo songs, dances, and rituals to younger generations. These sessions will prepare participants for the upcoming Irrecha celebrations and ensure cultural continuity."
    },
    {
      "title": "Environmental Conservation Initiative",
      "date": "2024-12-15",
      "content": "In line with Irrecha's emphasis on harmony with nature, a major environmental conservation project has been launched around Hora Arsadi. The initiative includes tree planting, water conservation, and sustainable tourism practices to protect the sacred site."
    },
    {
      "title": "Academic Conference on Oromo Culture",
      "date": "2024-12-10",
      "content": "An international academic conference on Oromo culture, history, and the significance of Irrecha will be held in March 2025. Scholars, researchers, and cultural experts from around the world will present papers on various aspects of Oromo heritage."
    }
  ]